{
  "backend/main.mo": "Defines the backend actor storing per‑principal fitness data with workouts, meals, activities, and goals, including access control and profile management.",
  "feature_evidence.json": "Lists implemented features with linked files, components, tests, and confidence for the app’s fitness, nutrition, and activity tracking functionality.",
  "frontend-file-summaries.txt": "Provides human‑written one‑line summaries for each frontend file describing its role in the app.",
  "frontend/index.css": "Defines global Tailwind and theme variables for light/dark modes using OKLCH color tokens.",
  "frontend/index.html": "Bootstrap HTML file mounting the React app via main.tsx.",
  "frontend/src/App.tsx": "Main React entry configuring routing, authentication flow, profile setup gating, and page layout.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button handling Internet Identity auth and clearing React Query cache on logout.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Modal dialog prompting new users to set display name and units and saving the profile.",
  "frontend/src/components/layout/AppLayout.tsx": "Layout wrapper providing navigation and page container for authenticated routes.",
  "frontend/src/components/layout/PrimaryNav.tsx": "Sidebar and mobile navigation component rendering links based on current route and user profile.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useCurrentUserProfile.ts": "Fetches the current user's profile using the active actor with loading state tied to identity availability.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context, handling login, logout, identity persistence, and AuthClient setup.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for CRUD operations on workouts, goals, meals, and activities via the backend actor.",
  "frontend/src/index.css": "Tailwind base styles with custom CSS variables for light/dark themes and utility animations.",
  "frontend/src/lib/nutritionEstimator.ts": "Generates deterministic nutrition estimates for meal photos based on filename hashing.",
  "frontend/src/lib/units.ts": "Utility functions for formatting and converting distances and weights between metric and imperial units.",
  "frontend/src/main.tsx": "Application entry point initializing React, Internet Identity provider, and React Query client.",
  "frontend/src/pages/ActivityPage.tsx": "Activity tracking page that starts/stops sessions, simulates metrics, and saves results using backend hooks.",
  "frontend/src/pages/DashboardPage.tsx": "Displays a dashboard that aggregates weekly workouts, activities, meals, and goals into summary cards using user profile units.",
  "frontend/src/pages/GoalsPage.tsx": "Provides UI for creating, viewing, and deleting fitness goals with progress tracking and type selection.",
  "frontend/src/pages/NutritionPage.tsx": "Allows logging meals with photo upload, simulated AI nutrition estimation, and manual nutrition entry and deletion.",
  "frontend/src/pages/SettingsPage.tsx": "Manages user profile settings including display name, units, data export, and full data deletion.",
  "frontend/src/pages/WorkoutsPage.tsx": "Enables logging workouts with exercises and sets, viewing existing workouts, and deleting entries.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL and hash parameters, and persisting them in sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, layout, animations, and enabling plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata describing app goals, required features, images, and known issues for a premium fitness tracker."
}